# -*- coding: UTF-8 -*-

special_word_list = ['其中:', '一、', '二、', '三、', '四、', '五、', '六、', '七、',
                     '（新）', '（一）', '（二）', '（合计平衡项目）', '（合计平衡项目2）', '（或股东权益）', '（非流动）',
                     '（应付债券）', '其他权益工具', '（股本）']

title_word_list = ['证券', '代码', '报告', '日期', '简称', '单位', '人民币元']

company_word_list = ['东方盛宏', '东旭光电', '中成股份', '南京公用', '合肥百货', '益华健康', '川能动力', '常山北明', '渤海租赁',
                     '英特集团', '许继电气', 'TCL科技', '中联重科', '丰源药业', '兴业矿业', '冀东水泥', '华数传媒', '双林生物',
                     '国际实业', '民生控股', '潍柴动力', '申万宏源', '美的集团', '胜利股份', '东阿阿胶', '吉林化纤', '徐工机械',
                     '通程控股', '长虹华意', '金融街']

lrb_word_list = ['营业', '总收入', '收入', '利息', '保费', '手续费', '佣金', '其他', '业务', '营业', '项目', '总成本', '成本',
                 '支出', '研发', '费用', '退保金', '赔付', '净额', '提取', '保险', '合同', '准备金', '保单', '红利', '分保',
                 '税金', '附加', '销售', '管理', '财务', '资产', '减值', '损失', '信用', '收益', '公允', '价值', '变动', '投资',
                 '联营企业', '合营企业', '净敞口套期', '汇兑', '处置', '利润', '平衡', '流动', '利得', '净损失', '影响', '总额',
                 '所得税', '确认', '净利润', '差额', '合计', '持续', '经营', '终止', '合并方', '合并', '实现', '归属', '母公司',
                 '股东', '少数', '损益', '基本', '稀释', '综合', '所有者', '摊余', '计量', '金融']

xjllb_word_list = ['产生', '现金', '流量', '活动', '商品', '提供', '劳务', '客户', '存款', '同业', '存放', '款项', '增加额',
                   '中央', '银行', '借款', '机构', '拆入', '资金', '收到', '取得', '再保险', '原保险', '保户', '储金', '投资款',
                   '收取', '发放', '贷款', '垫款', '减少', '减少额', '回购', '税费', '返还', '流入', '小计', '购买', '接受',
                   '支付', '职工', '以及', '各项', '固定资产', '流出', '无形资产', '长期资产', '子公司', '质押', '定期存款', '购建',
                   '质押贷款', '营业单位', '筹资', '吸收', '其中', '发行', '债券', '偿还', '分配', '股利', '偿付', '股权', '减资',
                   '等价物', '汇率', '期初', '补充', '资料', '资产减值', '折旧', '油气', '折耗', '生产', '生物', '投资性', '生产性',
                   '摊销', '递延', '预计', '负债', '存货', '经营性', '应收项目', '应付项目', '间接法', '债务', '资本', '转为',
                   '一年内', '到期', '转换', '融资', '租入', '涉及', '收支', '期末', '平衡项目', '其他项目']

zcfzb_word_list = ['资产负债', '结算', '备付金', '融出', '拆出', '交易', '交易性', '当期', '衍生', '票据', '账款', '应收', '分保',
                   '应收款', '出口', '退税', '补贴', '内部', '买入', '返售', '划分', '持有', '流动资产', '代理', '债权', '非流动',
                   '在建', '工程', '物资', '工具', '清理', '使用权', '开发', '商誉', '待摊费用', '短期', '预收', '卖出', '薪酬',
                   '应交', '买卖', '待售', '优先股', '永续债', '租赁', '专项', '权益', '实收', '股本', '公积金', '库存', '储备',
                   '盈余', '公积', '风险', '准备', '拟分配', '外币', '报表', '折算']
